USAGE.org
#+TITLE: ε-prolog Usage Examples and Tests
#+AUTHOR: Masaya Taniguchi
#+PROPERTY: header-args:emacs-lisp :tangle yes

* Introduction

This file contains comprehensive examples and executable tests for ε-prolog, combining practical examples from README.org and eprolog.el. Each section demonstrates specific features with working ERT tests.

To run all tests:
#+BEGIN_SRC bash :eval no
emacs -batch -l eprolog.el -l USAGE.org -f ert-run-tests-batch-and-exit
#+END_SRC

Or interactively:
#+BEGIN_SRC emacs-lisp :eval never :tangle no
(org-babel-load-file "USAGE.org")
(ert-run-tests-interactively t)
#+END_SRC

* Setup

This section establishes the testing environment for ε-prolog. We define helper functions that make it easy to test whether queries succeed or fail, collect multiple solutions, and restore the clean state between tests.

The setup includes:
- Loading required libraries (eprolog and ert for testing)
- Helper functions for testing query success/failure
- Solution collection utilities
- State restoration mechanisms to ensure test isolation

#+BEGIN_SRC emacs-lisp
(require 'eprolog)
(require 'ert)

;; Helper function to test query success
(defun eprolog-test--has-solution-p (goals)
  "Test if GOALS has at least one solution."
  (let ((found-solution nil))
    (eprolog-solve goals 
      :success (lambda (_) (setq found-solution t)))
    found-solution))

;; Helper function to collect all solutions
(defun eprolog-test--collect-solutions (goals)
  "Collect all solutions for GOALS."
  (let ((solutions '()))
    (eprolog-solve goals
      :success (lambda (solution) 
                 (push solution solutions)))
    (nreverse solutions)))

;; Store built-in predicates for restoration
(defvar eprolog-usage--builtin-predicates
  (when (boundp 'eprolog-clause-database)
    (copy-alist eprolog-clause-database))
  "Saved copy of built-in predicates for test restoration.")

;; Helper function to restore builtins (same as existing tests)
(defun eprolog-test--restore-builtins ()
  "Restore built-in predicates and clear user-defined ones."
  (setq eprolog-clause-database (copy-alist eprolog-usage--builtin-predicates)))
#+END_SRC

* Core Prolog Functionality

This section covers the fundamental building blocks of ε-prolog: facts, rules, and basic logical reasoning. These are the core concepts that every Prolog programmer must understand.

** Facts and Rules

Facts represent basic truths in your knowledge base, while rules define logical relationships and implications. In ε-prolog, you define facts and rules using `eprolog-define-predicate`. The following tests demonstrate basic fact definition, rule creation, and querying.

This subsection shows:
- How to define simple facts (parent relationships)
- How to create rules that derive new information (grandparent from parent relationships)
- How to query the knowledge base
- How to collect multiple solutions from queries

#+BEGIN_SRC emacs-lisp
(ert-deftest eprolog-usage-basic-facts-and-rules ()
  "Test basic fact and rule definition from README.org examples."
  (eprolog-test--restore-builtins)
  
  ;; Define facts using convenient alias
  (eprolog-define-predicate (parent tom bob))
  (eprolog-define-predicate (parent tom liz))
  (eprolog-define-predicate (parent bob ann))
  (eprolog-define-predicate (parent bob pat))
  (eprolog-define-predicate (parent pat jim))
  
  ;; Define rule
  (eprolog-define-predicate (grandparent _x _z)
    (parent _x _y)
    (parent _y _z))
  
  ;; Test basic facts
  (should (eprolog-test--has-solution-p '((parent tom bob))))
  (should (eprolog-test--has-solution-p '((parent pat jim))))
  (should-not (eprolog-test--has-solution-p '((parent jim tom))))
  
  ;; Test rule - grandparent relationships
  (should (eprolog-test--has-solution-p '((grandparent tom ann))))
  (should (eprolog-test--has-solution-p '((grandparent tom pat))))
  (should (eprolog-test--has-solution-p '((grandparent bob jim))))
  (should-not (eprolog-test--has-solution-p '((grandparent ann tom))))
  
  ;; Test solution collection
  (let ((solutions (eprolog-test--collect-solutions '((grandparent tom _x)))))
    (should (= (length solutions) 2))
    (should (member 'ann (mapcar (lambda (s) (cdr (assoc '_x s))) solutions)))
    (should (member 'pat (mapcar (lambda (s) (cdr (assoc '_x s))) solutions)))))
#+END_SRC

This test demonstrates the basic building blocks of Prolog programming: facts and rules. We create a simple family tree with parent relationships and then define a rule to derive grandparent relationships. The test shows how to verify that facts are correctly stored and that rules correctly infer new information.

#+BEGIN_SRC emacs-lisp
(ert-deftest eprolog-usage-predicate-definition-tests ()
  "Test basic predicate definition functionality."
  (eprolog-test--restore-builtins)
  
  ;; Test defining simple facts
  (eprolog-define-predicate (parent tom bob))
  (eprolog-define-predicate (parent bob ann))
  
  (should (eprolog-test--has-solution-p '((parent tom bob))))
  (should (eprolog-test--has-solution-p '((parent bob ann))))
  (should-not (eprolog-test--has-solution-p '((parent ann tom)))))
#+END_SRC

This test focuses specifically on the mechanics of defining facts. It shows the most basic operation in Prolog: asserting that certain relationships hold. This forms the foundation for more complex logical reasoning.

#+BEGIN_SRC emacs-lisp
(ert-deftest eprolog-usage-predicate-replacement ()
  "Test predicate replacement with ! operator."
  (eprolog-test--restore-builtins)
  
  ;; Define multiple clauses for same predicate
  (eprolog-define-predicate (test-pred a))
  (eprolog-define-predicate (test-pred b))
  (should (= (length (eprolog-test--collect-solutions '((test-pred _x)))) 2))
  
  ;; Replace with ! - should clear existing clauses
  (eprolog-define-predicate! (test-pred c))
  (let ((solutions (eprolog-test--collect-solutions '((test-pred _x)))))
    (should (= (length solutions) 1))
    (should (equal (cdr (assoc '_x (car solutions))) 'c))))
#+END_SRC

This test demonstrates predicate replacement semantics in ε-prolog. When you use `eprolog-define-predicate!` with the exclamation mark, it replaces all existing clauses for that predicate. This is important for understanding how to update your knowledge base dynamically.

#+BEGIN_SRC emacs-lisp
(ert-deftest eprolog-usage-family-tree-sazae-san ()
  "Test family tree relationships with Sazae-san characters."
  (eprolog-test--restore-builtins)
  
  ;; Setup family tree
  (eprolog-define-prolog-predicate! (parent katsuo fune))
  (eprolog-define-prolog-predicate (parent wakame fune))
  (eprolog-define-prolog-predicate (parent sazae fune))
  (eprolog-define-prolog-predicate (parent tarao sazae))
  
  (eprolog-define-prolog-predicate! (grandparent _x _z)
    (parent _x _y)
    (parent _y _z))
  
  ;; Test basic parent relationships
  (should (eprolog-test--has-solution-p '((parent katsuo fune))))
  (should (eprolog-test--has-solution-p '((parent tarao sazae))))
  
  ;; Test grandparent relationship
  (should (eprolog-test--has-solution-p '((grandparent tarao fune)))))
#+END_SRC

