USAGE.org
** Unification and Equality

Unification is the process of making two terms equal by finding appropriate variable bindings. This is the core mechanism that makes Prolog work. ε-prolog provides several predicates for different types of equality and unification.

This subsection covers:
- The `=/2` predicate for unification (allows variable binding)
- The `==/2` predicate for strict equality (no variable binding)
- How variables get bound during unification
- The difference between unification and strict equality

#+BEGIN_SRC emacs-lisp
(ert-deftest eprolog-usage-unification-and-equality ()
  "Test unification and equality predicates."
  (eprolog-test--restore-builtins)
  
  ;; Test =/2 (unification)
  (should (eprolog-test--has-solution-p '((= foo foo))))
  (should (eprolog-test--has-solution-p '((= _x bar) (= _x bar))))
  (should-not (eprolog-test--has-solution-p '((= foo bar))))
  
  ;; Test ==/2 (strict equality)
  (should (eprolog-test--has-solution-p '((== foo foo))))
  (should-not (eprolog-test--has-solution-p '((== _x foo)))))
#+END_SRC

This test shows the fundamental difference between unification (`=`) and strict equality (`==`). Unification can bind variables to make terms equal, while strict equality only succeeds if terms are already identical.

#+BEGIN_SRC emacs-lisp
(ert-deftest eprolog-usage-variable-unification-advanced ()
  "Test advanced variable unification patterns."
  (eprolog-test--restore-builtins)
  
  ;; Define test predicates
  (eprolog-define-predicate (likes mary food))
  (eprolog-define-predicate (likes mary wine))
  (eprolog-define-predicate (likes john wine))
  
  ;; Test multiple solutions with same variable
  (let ((solutions (eprolog-test--collect-solutions '((likes mary _x)))))
    (should (= (length solutions) 2))
    (should (member '((_x . food)) solutions))
    (should (member '((_x . wine)) solutions)))
  
  ;; Test unification with complex terms
  (let ((solutions (eprolog-test--collect-solutions '((= _x 42)))))
    (should (= (length solutions) 1))
    (should (equal (cdr (assoc '_x (car solutions))) 42))))
#+END_SRC

This test demonstrates more complex unification scenarios, showing how variables get bound during query execution and how you can collect multiple solutions with different variable bindings.

#+BEGIN_SRC emacs-lisp
(ert-deftest eprolog-usage-anonymous-variables ()
  "Test anonymous variable handling."
  (eprolog-test--restore-builtins)
  
  ;; Test anonymous variables don't unify with each other
  (eprolog-define-predicate (test _ _))
  (should (eprolog-test--has-solution-p '((test a b))))
  (should (eprolog-test--has-solution-p '((test foo bar))))
  (should (eprolog-test--has-solution-p '((test _x _y)))))
#+END_SRC

Anonymous variables (represented by `_`) are special in Prolog. Each `_` is treated as a unique variable that you don't care about the value of. This is useful when you need to match a pattern but don't need to use some of the matched values.

#+BEGIN_SRC emacs-lisp
(ert-deftest eprolog-usage-occurs-check ()
  "Test occurs check in unification."
  (eprolog-test--restore-builtins)
  
  ;; Test occurs check prevents infinite structures
  (let ((eprolog-occurs-check t))
    (should-not (eprolog-test--has-solution-p '((= _x (_x)))))
    (should-not (eprolog-test--has-solution-p '((= _x (f _x)))))))
#+END_SRC

* Built-in Predicates

ε-prolog comes with a comprehensive set of built-in predicates that provide essential functionality for type checking, list manipulation, and higher-order operations. These predicates form the standard library that most Prolog programs rely on.

** Type Checking

Type checking predicates allow you to test what kind of data you're working with. This is essential for writing robust Prolog programs that handle different data types appropriately.

This subsection demonstrates:
- `atom/1` for testing atomic values
- `var/1` for testing unbound variables  
- `number/1` for testing numeric values
- `string/1` for testing string values
- `ground/1` for testing if a term contains no variables

#+BEGIN_SRC emacs-lisp
(ert-deftest eprolog-usage-type-checking ()
  "Test type checking predicates from README.org."
  (eprolog-test--restore-builtins)
  
  ;; Test atom/1
  (should (eprolog-test--has-solution-p '((atom foo))))
  (should-not (eprolog-test--has-solution-p '((atom (a b)))))
  
  ;; Test var/1
  (should (eprolog-test--has-solution-p '((var _x))))
  (should-not (eprolog-test--has-solution-p '((var foo))))
  
  ;; Test number/1
  (should (eprolog-test--has-solution-p '((number 42))))
  (should-not (eprolog-test--has-solution-p '((number foo))))
  
  ;; Test string/1
  (should (eprolog-test--has-solution-p '((string "hello"))))
  (should-not (eprolog-test--has-solution-p '((string foo)))))
#+END_SRC

This test shows how to use the basic type checking predicates. These are fundamental for writing predicates that need to behave differently depending on the type of their arguments.

#+BEGIN_SRC emacs-lisp
(ert-deftest eprolog-usage-ground-predicate ()
  "Test ground term checking."
  (eprolog-test--restore-builtins)
  
  ;; Test ground terms
  (should (eprolog-test--has-solution-p '((ground 42))))
  (should (eprolog-test--has-solution-p '((ground (a b c)))))
  (should (eprolog-test--has-solution-p '((ground foo))))
  
  ;; Test non-ground terms
  (should-not (eprolog-test--has-solution-p '((ground _x))))
  (should-not (eprolog-test--has-solution-p '((ground (a _x c))))))
#+END_SRC

** List Operations

List processing is central to Prolog programming. ε-prolog provides powerful built-in predicates for working with lists, including membership testing, concatenation, and list transformation.

This subsection covers:
- `member/2` for testing list membership and generating list elements
- `append/3` for list concatenation and decomposition
- `append/2` for concatenating a list of lists
- How these predicates work in multiple directions (testing, generating, decomposing)

#+BEGIN_SRC emacs-lisp
(ert-deftest eprolog-usage-list-operations ()
  "Test list operation predicates from README.org examples."
  (eprolog-test--restore-builtins)
  
  ;; Test member/2 as shown in README
  (let ((solutions (eprolog-test--collect-solutions '((member _x (a b c))))))
    (should (= (length solutions) 3))
    (should (member 'a (mapcar (lambda (s) (cdr (assoc '_x s))) solutions)))
    (should (member 'b (mapcar (lambda (s) (cdr (assoc '_x s))) solutions)))
    (should (member 'c (mapcar (lambda (s) (cdr (assoc '_x s))) solutions))))
  
  ;; Test specific membership
  (should (eprolog-test--has-solution-p '((member a (a b c)))))
  (should (eprolog-test--has-solution-p '((member b (a b c)))))
  (should (eprolog-test--has-solution-p '((member c (a b c)))))
  (should-not (eprolog-test--has-solution-p '((member d (a b c)))))
  
  ;; Test append/3 as shown in README
  (let ((solutions (eprolog-test--collect-solutions '((append (1 2) (3 4) _result)))))
    (should (= (length solutions) 1))
    (should (equal (cdr (assoc '_result (car solutions))) '(1 2 3 4))))
  
  ;; Test append/3 variations
  (should (eprolog-test--has-solution-p '((append (1 2) (3 4) (1 2 3 4)))))
  (should (eprolog-test--has-solution-p '((append () (1 2 3) (1 2 3)))))
  (should (eprolog-test--has-solution-p '((append (1 2 3) () (1 2 3)))))
  
  ;; Test append/2
  (let ((solutions (eprolog-test--collect-solutions '((append ((1 2) (3 4)) _result)))))
    (should (= (length solutions) 1))
    (should (equal (cdr (assoc '_result (car solutions))) '(1 2 3 4)))))
#+END_SRC

** Higher-order Predicates

Higher-order predicates take other predicates as arguments, enabling powerful patterns for list processing and transformation. These predicates implement common functional programming patterns in a logical setting.

This subsection demonstrates:
- `maplist/2` for applying a predicate to all elements of a list
- `maplist/3` for applying a binary predicate to corresponding elements of two lists
- How to use predicates as arguments to other predicates

#+BEGIN_SRC emacs-lisp
(ert-deftest eprolog-usage-higher-order-predicates ()
  "Test maplist higher-order predicates."
  (eprolog-test--restore-builtins)
  
  ;; Define helper predicate
  (eprolog-define-predicate (succ _x _y)
    (is _y (+ _x 1)))
  
  ;; Test maplist/2
  (should (eprolog-test--has-solution-p '((maplist succ (1 2 3) (2 3 4)))))
  (should-not (eprolog-test--has-solution-p '((maplist succ (1 2 3) (2 3 5)))))
  
  ;; Test maplist/1
  (eprolog-define-predicate (positive _x) (lispp (> _x 0)))
  (should (eprolog-test--has-solution-p '((maplist positive (1 2 3)))))
  (should-not (eprolog-test--has-solution-p '((maplist positive (0 1 2))))))
#+END_SRC

* Control Flow

Control flow in Prolog is fundamentally different from imperative languages. Instead of explicit loops and conditionals, Prolog uses logical predicates to control execution flow, backtracking, and choice points.

