USAGE.el

(ert-deftest eprolog-usage-dcg-basic ()
  "Test basic DCG functionality."
  (eprolog-test--restore-builtins)
  (eprolog-define-grammar! noun "cat")
  (eprolog-define-grammar noun "dog")  ; Use without ! to add second clause
  (eprolog-define-grammar! verb "runs")
  (eprolog-define-grammar! sentence noun verb)
  
  (should (eprolog-test--has-solution-p '((phrase sentence ("cat" "runs")))))
  (should (eprolog-test--has-solution-p '((phrase sentence ("dog" "runs")))))
  (should-not (eprolog-test--has-solution-p '((phrase sentence ("cat" "sleeps"))))))

(ert-deftest eprolog-usage-dcg-basic-grammar ()
  "Test basic DCG grammar definition and parsing."
  (eprolog-test--restore-builtins)
  
  ;; Define grammar
  (eprolog-define-grammar! s np vp)
  (eprolog-define-grammar! np det noun)
  (eprolog-define-grammar! vp verb np)
  (eprolog-define-grammar! det "the")
  (eprolog-define-grammar det "a")
  (eprolog-define-grammar! noun "cat")
  (eprolog-define-grammar noun "dog")
  (eprolog-define-grammar! verb "chases")
  (eprolog-define-grammar verb "sees")
  
  ;; Test parsing valid sentences
  (should (eprolog-test--has-solution-p '((phrase s ("the" "cat" "chases" "a" "dog")))))
  (should (eprolog-test--has-solution-p '((phrase s ("a" "dog" "sees" "the" "cat")))))
  
  ;; Test parsing invalid sentences
  (should-not (eprolog-test--has-solution-p '((phrase s ("cat" "the" "chases"))))))

(ert-deftest eprolog-usage-dcg-parsing-with-remainder ()
  "Test DCG parsing with remainder."
  (eprolog-test--restore-builtins)
  
  ;; Define grammar  
  (eprolog-define-grammar! s np vp)
  (eprolog-define-grammar! np det noun)
  (eprolog-define-grammar! vp verb np)
  (eprolog-define-grammar! det "the")
  (eprolog-define-grammar! noun "cat")
  (eprolog-define-grammar! verb "chases")
  
  ;; Test parsing with remainder
  (let ((solutions (eprolog-test--collect-solutions 
                    '((phrase s ("the" "cat" "chases" "the" "cat" "quickly") _rest)))))
    (should (= (length solutions) 1))
    (should (equal (cdr (assoc '_rest (car solutions))) '("quickly")))))

(ert-deftest eprolog-usage-dcg-epsilon-productions ()
  "Test DCG epsilon (empty) productions."
  (eprolog-test--restore-builtins)
  
  ;; Test epsilon productions
  (eprolog-define-grammar! optional-adj nil)
  (eprolog-define-grammar optional-adj adj)
  (eprolog-define-grammar! np det optional-adj noun)
  (eprolog-define-grammar! det "the")
  (eprolog-define-grammar! adj "big")
  (eprolog-define-grammar! noun "cat")
  
  (should (eprolog-test--has-solution-p '((phrase np ("the" "cat")))))
  (should (eprolog-test--has-solution-p '((phrase np ("the" "big" "cat"))))))

(ert-deftest eprolog-usage-dcg-with-args ()
  "Test DCG with arguments."
  (eprolog-test--restore-builtins)
  
  ;; Test DCG rules with arguments for grammatical agreement
  (eprolog-define-grammar! (noun singular) "cat")
  (eprolog-define-grammar (noun plural) "cats")
  (eprolog-define-grammar! (det singular) "a")
  (eprolog-define-grammar (det plural) "some")
  
  ;; Test singular and plural agreement
  (should (eprolog-test--has-solution-p '((phrase (noun singular) ("cat")))))
  (should (eprolog-test--has-solution-p '((phrase (noun plural) ("cats")))))
  (should (eprolog-test--has-solution-p '((phrase (det singular) ("a")))))
  (should (eprolog-test--has-solution-p '((phrase (det plural) ("some")))))
  
  ;; Test mismatched agreement
  (should-not (eprolog-test--has-solution-p '((phrase (noun singular) ("cats")))))
  (should-not (eprolog-test--has-solution-p '((phrase (noun plural) ("cat"))))))

(ert-deftest eprolog-usage-dcg-semantic-actions ()
  "Test DCG semantic actions."
  (eprolog-test--restore-builtins)
  
  ;; Test semantic actions
  (eprolog-define-grammar! (s _num) (np _num) (vp _num))
  (eprolog-define-grammar! (np _num) (det _num) (noun _num))
  (eprolog-define-grammar! (vp _num) (verb _num) (np _))
  (eprolog-define-grammar! (det singular) "a")
  (eprolog-define-grammar (det plural) "some")
  (eprolog-define-grammar! (noun singular) "cat")
  (eprolog-define-grammar (noun plural) "cats")
  (eprolog-define-grammar! (verb singular) "chases")
  (eprolog-define-grammar (verb plural) "chase")
  
  (should (eprolog-test--has-solution-p '((phrase (s _) ("a" "cat" "chases" "some" "cats")))))
  (should-not (eprolog-test--has-solution-p '((phrase (s _) ("a" "cat" "chase" "some" "cats"))))))

(ert-deftest eprolog-usage-dcg-cut-operations ()
  "Test DCG cut operations."
  (eprolog-test--restore-builtins)
  
  ;; Test cut operations
  (eprolog-define-grammar! statement declarative !)
  (eprolog-define-grammar statement question)
  (eprolog-define-grammar! declarative s ".")
  (eprolog-define-grammar! question s "?")
  (eprolog-define-grammar! s "test")
  
  (should (eprolog-test--has-solution-p '((phrase statement ("test" "."))))))

(ert-deftest eprolog-usage-dcg-generation ()
  "Test DCG sentence generation."
  (eprolog-test--restore-builtins)
  
  ;; Define simple grammar
  (eprolog-define-grammar! s np vp)
  (eprolog-define-grammar! np det noun)
  (eprolog-define-grammar! vp verb)
  (eprolog-define-grammar! det "the")
  (eprolog-define-grammar! noun "cat")
  (eprolog-define-grammar! verb "runs")
  
  ;; Test sentence generation
  (let ((solutions (eprolog-test--collect-solutions '((phrase s _sentence)))))
    (should (> (length solutions) 0))
    (should (equal (cdr (assoc '_sentence (car solutions))) '("the" "cat" "runs")))))

(ert-deftest eprolog-usage-dcg-length-constrained-generation ()
  "Test DCG generation with length constraints."
  (eprolog-test--restore-builtins)
  
  ;; Test length-constrained generation
  (eprolog-define-predicate (length () 0))
  (eprolog-define-predicate (length (_h . _t) _n)
    (length _t _n1)
    (is _n (+ _n1 1)))
  
  (eprolog-define-grammar! s2 det noun verb)
  (eprolog-define-grammar! det "a")
  (eprolog-define-grammar! noun "cat")
  (eprolog-define-grammar! verb "runs")
  
  (let ((solutions (eprolog-test--collect-solutions '((phrase s2 _sentence) (length _sentence 3)))))
    (should (= (length solutions) 1))
    (should (equal (cdr (assoc '_sentence (car solutions))) '("a" "cat" "runs")))))

(ert-deftest eprolog-usage-dcg-arithmetic-expressions ()
