USAGE.el
  "Test arithmetic expression parsing with DCG."
  (eprolog-test--restore-builtins)
  
  ;; Define arithmetic grammar
  (eprolog-define-grammar! expr term)
  (eprolog-define-grammar expr term "+" expr)
  (eprolog-define-grammar expr term "-" expr)
  (eprolog-define-grammar! term factor)
  (eprolog-define-grammar term factor "*" term)
  (eprolog-define-grammar term factor "/" term)
  (eprolog-define-grammar! factor digit)
  (eprolog-define-grammar factor "(" expr ")")
  (eprolog-define-grammar! digit "1")
  (eprolog-define-grammar digit "2")
  (eprolog-define-grammar digit "3")
  (eprolog-define-grammar digit "4")
  
  ;; Test arithmetic expression parsing
  (should (eprolog-test--has-solution-p '((phrase expr ("2")))))
  (should (eprolog-test--has-solution-p '((phrase expr ("2" "+" "3" "*" "4")))))
  (should (eprolog-test--has-solution-p '((phrase expr ("(" "2" "+" "3" ")" "*" "4"))))))

(ert-deftest eprolog-usage-dcg-nested-structures ()
  "Test nested structure parsing with DCG."
  (eprolog-test--restore-builtins)
  
  ;; Define nested parentheses grammar
  (eprolog-define-grammar! parens nil)
  (eprolog-define-grammar parens "(" parens ")" parens)
  
  ;; Test balanced parentheses
  (should (eprolog-test--has-solution-p '((phrase parens ()))))
  (should (eprolog-test--has-solution-p '((phrase parens ("(" ")")))))
  (should (eprolog-test--has-solution-p '((phrase parens ("(" "(" ")" "(" ")" ")")))))
  (should-not (eprolog-test--has-solution-p '((phrase parens ("(" "(" ")"))))))

(ert-deftest eprolog-usage-dcg-csv-parsing ()
  "Test CSV-style parsing with DCG."
  (eprolog-test--restore-builtins)
  
  ;; Test CSV-style parsing
  (eprolog-define-grammar! csv-list item)
  (eprolog-define-grammar csv-list item "," csv-list)
  (eprolog-define-grammar! item "apple")
  (eprolog-define-grammar item "banana")
  (eprolog-define-grammar item "cherry")
  
  (should (eprolog-test--has-solution-p '((phrase csv-list ("apple")))))
  (should (eprolog-test--has-solution-p '((phrase csv-list ("apple" "," "banana" "," "cherry"))))))
