USAGE.org
** Comprehensive Family Tree Tests

Family trees provide an excellent example of how basic facts can be combined with rules to derive complex relationships. We start with basic parent relationships and build up to sophisticated kinship queries.

This subsection covers:
- Basic parent and marriage relationships
- Gender distinctions for more precise relationship modeling
- How facts and rules work together to build knowledge bases
- The foundation for more complex relationship derivations

#+BEGIN_SRC emacs-lisp
(ert-deftest eprolog-usage-family-tree-comprehensive ()
  "Test comprehensive family tree with Sazae-san characters."
  (eprolog-test--restore-builtins)
  
  ;; Define parent relationships
  (eprolog-define-prolog-predicate! (parent katsuo fune))
  (eprolog-define-prolog-predicate (parent wakame fune))
  (eprolog-define-prolog-predicate (parent sazae fune))
  (eprolog-define-prolog-predicate (parent tarao sazae))
  (eprolog-define-prolog-predicate (parent ikura taiko))
  
  ;; Define marriage relationships
  (eprolog-define-prolog-predicate! (married _x _y) (married-fact _x _y))
  (eprolog-define-prolog-predicate (married _x _y) (married-fact _y _x))
  
  (eprolog-define-prolog-predicate! (married-fact fune namihei))
  (eprolog-define-prolog-predicate (married-fact sazae masuo))
  (eprolog-define-prolog-predicate (married-fact taiko norisuke))
  
  ;; Define gender
  (eprolog-define-prolog-predicate! (male namihei))
  (eprolog-define-prolog-predicate (male katsuo))
  (eprolog-define-prolog-predicate (male masuo))
  (eprolog-define-prolog-predicate (male tarao))
  (eprolog-define-prolog-predicate (male norisuke))
  
  (eprolog-define-prolog-predicate! (female fune))
  (eprolog-define-prolog-predicate (female sazae))
  (eprolog-define-prolog-predicate (female taiko))
  (eprolog-define-prolog-predicate (female wakame))
  
  ;; Test basic relationships
  (should (eprolog-test--has-solution-p '((parent katsuo fune))))
  (should (eprolog-test--has-solution-p '((married fune namihei))))
  (should (eprolog-test--has-solution-p '((male katsuo))))
  (should (eprolog-test--has-solution-p '((female wakame)))))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(ert-deftest eprolog-usage-family-tree-derived-relationships ()
  "Test derived family relationships."
  (eprolog-test--restore-builtins)
  
  ;; Setup basic relationships
  (eprolog-define-prolog-predicate! (parent katsuo fune))
  (eprolog-define-prolog-predicate (parent wakame fune))
  (eprolog-define-prolog-predicate (parent sazae fune))
  (eprolog-define-prolog-predicate (parent tarao sazae))
  
  (eprolog-define-prolog-predicate! (male katsuo))
  (eprolog-define-prolog-predicate! (female fune))
  (eprolog-define-prolog-predicate (female sazae))
  (eprolog-define-prolog-predicate (female wakame))
  
  ;; Define derived relationships
  (eprolog-define-prolog-predicate! (child _x _y) (parent _y _x))
  (eprolog-define-prolog-predicate! (grandparent _x _z) (parent _x _y) (parent _y _z))
  (eprolog-define-prolog-predicate! (sibling _x _y) (parent _x _z) (parent _y _z) (not (= _x _y)))
  (eprolog-define-prolog-predicate! (mother _x _y) (parent _x _y) (female _y))
  (eprolog-define-prolog-predicate! (father _x _y) (parent _x _y) (male _y))
  (eprolog-define-prolog-predicate! (sister _x _y) (sibling _x _y) (female _y))
  (eprolog-define-prolog-predicate! (brother _x _y) (sibling _x _y) (male _y))
  (eprolog-define-prolog-predicate! (ancestor _x _y) (parent _x _y))
  (eprolog-define-prolog-predicate (ancestor _x _y) (parent _x _z) (ancestor _z _y))
  
  ;; Test derived relationships
  (should (eprolog-test--has-solution-p '((child fune katsuo))))
  (should (eprolog-test--has-solution-p '((grandparent tarao fune))))
  (should (eprolog-test--has-solution-p '((sibling katsuo wakame))))
  (should (eprolog-test--has-solution-p '((mother katsuo fune))))
  (should (eprolog-test--has-solution-p '((sister katsuo wakame))))
  (should (eprolog-test--has-solution-p '((brother wakame katsuo))))
  (should (eprolog-test--has-solution-p '((ancestor tarao fune)))))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(ert-deftest eprolog-usage-family-tree-uncle-aunt-cousin ()
  "Test uncle, aunt, and cousin relationships."
  (eprolog-test--restore-builtins)
  
  ;; Setup family tree with extended relationships
  (eprolog-define-prolog-predicate! (parent katsuo fune))
  (eprolog-define-prolog-predicate (parent wakame fune))
  (eprolog-define-prolog-predicate (parent sazae fune))
  (eprolog-define-prolog-predicate (parent tarao sazae))
  (eprolog-define-prolog-predicate (parent child1 katsuo))
  (eprolog-define-prolog-predicate (parent child2 wakame))
  
  (eprolog-define-prolog-predicate! (male katsuo))
  (eprolog-define-prolog-predicate! (female fune))
  (eprolog-define-prolog-predicate (female sazae))
  (eprolog-define-prolog-predicate (female wakame))
  
  ;; Define extended relationships
  (eprolog-define-prolog-predicate! (sibling _x _y) (parent _x _z) (parent _y _z) (not (= _x _y)))
  (eprolog-define-prolog-predicate! (uncle _x _y) (parent _y _z) (sibling _x _z) (male _x))
  (eprolog-define-prolog-predicate! (aunt _x _y) (parent _y _z) (sibling _x _z) (female _x))
  (eprolog-define-prolog-predicate! (cousin _x _y) (parent _x _a) (parent _y _b) (sibling _a _b))
  
  ;; Test uncle/aunt relationships
  (should (eprolog-test--has-solution-p '((uncle katsuo tarao))))
  (should (eprolog-test--has-solution-p '((aunt wakame tarao))))
  
  ;; Test cousin relationships  
  (should (eprolog-test--has-solution-p '((cousin tarao child1))))
  (should (eprolog-test--has-solution-p '((cousin child1 child2)))))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(ert-deftest eprolog-usage-family-tree-complex-queries ()
  "Test complex family tree queries with multiple solutions."
  (eprolog-test--restore-builtins)
  
  ;; Setup complete family tree
  (eprolog-define-prolog-predicate! (parent katsuo fune))
  (eprolog-define-prolog-predicate (parent wakame fune))
  (eprolog-define-prolog-predicate (parent sazae fune))
  (eprolog-define-prolog-predicate (parent tarao sazae))
  (eprolog-define-prolog-predicate (parent ikura taiko))
  
  (eprolog-define-prolog-predicate! (grandparent _x _z) (parent _x _y) (parent _y _z))
  (eprolog-define-prolog-predicate! (sibling _x _y) (parent _x _z) (parent _y _z) (not (= _x _y)))
  
  ;; Test finding all children of fune
  (let ((solutions (eprolog-test--collect-solutions '((parent _child fune)))))
    (should (= (length solutions) 3))
    (should (member '((_child . katsuo)) solutions))
    (should (member '((_child . wakame)) solutions))
    (should (member '((_child . sazae)) solutions)))
  
  ;; Test finding all grandchildren of fune
  (let ((solutions (eprolog-test--collect-solutions '((grandparent _grandchild fune)))))
    (should (= (length solutions) 1))
    (should (member '((_grandchild . tarao)) solutions)))
  
  ;; Test finding all siblings of katsuo
  (let ((solutions (eprolog-test--collect-solutions '((sibling katsuo _sibling)))))
    (should (= (length solutions) 2))
    (should (member '((_sibling . wakame)) solutions))
    (should (member '((_sibling . sazae)) solutions))))
#+END_SRC

* Complex Backtracking and Control Flow

