USAGE.org
** Complex Backtracking Scenarios

#+BEGIN_SRC emacs-lisp
(ert-deftest eprolog-usage-complex-backtracking-with-cut ()
  "Test complex backtracking scenarios with cut."
  (eprolog-test--restore-builtins)
  
  ;; Define choice predicates
  (eprolog-define-prolog-predicate! (color red))
  (eprolog-define-prolog-predicate (color green))
  (eprolog-define-prolog-predicate (color blue))
  
  ;; Define predicate that uses cut
  (eprolog-define-prolog-predicate! (first-color _x)
    (color _x) !)
  
  ;; Test without cut - should get all solutions
  (let ((solutions (eprolog-test--collect-solutions '((color _x)))))
    (should (= (length solutions) 3)))
  
  ;; Test with cut - should get only first solution
  (let ((solutions (eprolog-test--collect-solutions '((first-color _x)))))
    (should (= (length solutions) 1))
    (should (equal (cdr (assoc '_x (car solutions))) 'red))))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(ert-deftest eprolog-usage-repeat-with-complex-conditions ()
  "Test repeat predicate with complex termination conditions."
  (eprolog-test--restore-builtins)
  
  ;; Test repeat with counter and cut
  (let ((counter 0))
    (eprolog-define-predicate (test-repeat-complex)
      (repeat)
      (lisp! (setq counter (1+ counter)))
      (lispp (>= counter 5))
      !)
    
    (should (eprolog-test--has-solution-p '((test-repeat-complex))))
    (should (= counter 5))))
#+END_SRC

* Advanced Applications

** Recursive Algorithms

#+BEGIN_SRC emacs-lisp
(ert-deftest eprolog-usage-factorial ()
  "Test recursive factorial implementation."
  (eprolog-test--restore-builtins)
  
  ;; Define factorial predicate
  (eprolog-define-predicate! (factorial 0 1))
  (eprolog-define-predicate (factorial _n _f)
    (lispp (> _n 0))
    (is _n1 (- _n 1))
    (factorial _n1 _f1)
    (is _f (* _n _f1)))
  
  ;; Test factorial calculations
  (let ((solutions (eprolog-test--collect-solutions '((factorial 0 _f)))))
    (should (= (length solutions) 1))
    (should (= (cdr (assoc '_f (car solutions))) 1)))
  
  (let ((solutions (eprolog-test--collect-solutions '((factorial 3 _f)))))
    (should (= (length solutions) 1))
    (should (= (cdr (assoc '_f (car solutions))) 6)))
  
  (let ((solutions (eprolog-test--collect-solutions '((factorial 5 _f)))))
    (should (= (length solutions) 1))
    (should (= (cdr (assoc '_f (car solutions))) 120))))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(ert-deftest eprolog-usage-fibonacci ()
  "Test Fibonacci sequence implementation."
  (eprolog-test--restore-builtins)
  
  ;; Define Fibonacci predicate
  (eprolog-define-predicate! (fib 0 0))
  (eprolog-define-predicate (fib 1 1))
  (eprolog-define-predicate (fib _n _f)
    (lispp (> _n 1))
    (is _n1 (- _n 1))
    (is _n2 (- _n 2))
    (fib _n1 _f1)
    (fib _n2 _f2)
    (is _f (+ _f1 _f2)))
 
  ;; Test Fibonacci calculations
  (let ((solutions (eprolog-test--collect-solutions '((fib 0 _f)))))
    (should (= (cdr (assoc '_f (car solutions))) 0)))
  
  (let ((solutions (eprolog-test--collect-solutions '((fib 1 _f)))))
    (should (= (cdr (assoc '_f (car solutions))) 1)))
  
  (let ((solutions (eprolog-test--collect-solutions '((fib 3 _f)))))
    (should (= (cdr (assoc '_f (car solutions))) 2)))
  
  (let ((solutions (eprolog-test--collect-solutions '((fib 4 _f)))))
    (should (= (cdr (assoc '_f (car solutions))) 3))))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(ert-deftest eprolog-usage-gcd-algorithm ()
  "Test Greatest Common Divisor algorithm."
  (eprolog-test--restore-builtins)
  
  ;; Define GCD predicate
  (eprolog-define-predicate! (gcd _a 0 _a))
  (eprolog-define-predicate (gcd _a _b _g)
    (lispp (> _b 0))
    (is _r (mod _a _b))
    (gcd _b _r _g))
  
  ;; Test GCD calculations
  (let ((solutions (eprolog-test--collect-solutions '((gcd 48 18 _g)))))
    (should (= (cdr (assoc '_g (car solutions))) 6)))
  
  (let ((solutions (eprolog-test--collect-solutions '((gcd 15 25 _g)))))
    (should (= (cdr (assoc '_g (car solutions))) 5))))
#+END_SRC

* Performance Testing

Performance testing ensures that ε-prolog can handle real-world applications with reasonable efficiency. These tests evaluate the system's behavior under various load conditions and help identify potential bottlenecks.

This section demonstrates:
- Large database performance with many facts
- Deep recursion handling and stack management
- Stress testing with complex predicate structures
- Memory and execution time considerations

#+BEGIN_SRC emacs-lisp
(ert-deftest eprolog-usage-performance-tests ()
  "Test performance with larger databases and deep recursion."
  (eprolog-test--restore-builtins)
  
  ;; Test large database performance
  (dotimes (i 100)
    (eval `(eprolog-define-predicate (test-num ,i))))
  
  (let ((solutions (eprolog-test--collect-solutions '((test-num _x)))))
    (should (= (length solutions) 100)))
  
  ;; Test deep recursion
  (eprolog-define-predicate! (count-down 0))
  (eprolog-define-predicate (count-down _n)
    (lispp (> _n 0))
    (is _n1 (- _n 1))
    (count-down _n1))
  
  (should (eprolog-test--has-solution-p '((count-down 10)))))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(ert-deftest eprolog-usage-large-database ()
  "Test performance with larger clause database."
  (eprolog-test--restore-builtins)
  (dotimes (i 100)
    (eval `(eprolog-define-predicate (test-num ,i))))
  
  (let ((solutions (eprolog-test--collect-solutions '((test-num _x)))))
    (should (= (length solutions) 100))))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(ert-deftest eprolog-usage-stress-testing ()
  "Test system behavior under stress conditions."
  (eprolog-test--restore-builtins)
  
  ;; Test many predicate clauses
  (dotimes (i 50)
    (eval `(eprolog-define-predicate (many-choices ,i))))
  
  ;; Test that all solutions are found
  (let ((solutions (eprolog-test--collect-solutions '((many-choices _x)))))
    (should (= (length solutions) 50)))
  
  ;; Test complex recursive predicate
  (eprolog-define-predicate! (deep-recursion 0 done))
  (eprolog-define-predicate (deep-recursion _n _result)
    (lispp (> _n 0))
    (is _n1 (- _n 1))
    (deep-recursion _n1 _result))
  
  ;; Test with reduced recursion depth to avoid eval depth limit
  (should (eprolog-test--has-solution-p '((deep-recursion 10 done)))))
#+END_SRC

* Test Runner

#+BEGIN_SRC emacs-lisp
(defun eprolog-usage-run-all-tests ()
  "Run all ε-prolog usage tests and display summary."
  (interactive)
  (let ((start-time (current-time)))
    (ert-run-tests-batch-and-exit "eprolog-usage-")
    (message "ε-prolog usage tests completed in %.2f seconds" 
             (float-time (time-subtract (current-time) start-time)))))

(provide 'eprolog-usage-tests)
#+END_SRC

* Footer

This file contains comprehensive test coverage for all ε-prolog features, organized by functionality with logical progression from basic to advanced concepts.

** Document Structure

*** Core Prolog Functionality
- Facts and Rules
- Unification and Equality
- Variable Unification Edge Cases
- Anonymous Variables
- Occurs Check

*** Built-in Predicates  
- Type Checking (including string/1 and ground/1)
- List Operations
- Higher-order Predicates

*** Control Flow
- Basic Control Predicates
- Logical Operators
- Meta-predicates
- Cut and Backtracking Control

*** Lisp Integration
- Basic Lisp Interface
- Dynamic Parameters

*** Arithmetic and Mathematics
- Basic Arithmetic
- Mathematical Predicates
- Arithmetic Comparisons
- Custom Comparison Predicates
- Absolute Value and Min/Max
- Geometric Calculations

*** DCG (Definite Clause Grammars)
- Basic Grammar Operations
- DCG with Arguments
- Advanced DCG Features
- Grammar Generation
- Complex Grammar Applications

*** Family Tree Relationships
- Comprehensive Family Tree Tests
- Derived Relationships (child, grandparent, sibling, etc.)
- Extended Relationships (uncle, aunt, cousin)
- Complex Family Queries

*** Complex Backtracking and Control Flow
- Complex Backtracking Scenarios
- Repeat with Complex Conditions

*** Advanced Applications
- Recursive Algorithms

*** Performance Testing
- Large Database and Deep Recursion Tests
- Stress Testing

** Key Features

1. **Logical Organization** - Sections progress from basic to advanced concepts
2. **Consistent Structure** - Each major section has clear subsections
3. **Individual Test Blocks** - Each test is in its own code block for easy execution
4. **Comprehensive Coverage** - Tests combine examples from README.org and eprolog.el
5. **Clear Documentation** - Each section explains its purpose and scope

To extend these tests:
1. Add new test functions following the =ert-deftest= pattern
2. Use =eprolog-test--restore-builtins= to ensure clean test state
3. Use helper functions =eprolog-test--has-solution-p= and =eprolog-test--collect-solutions=
4. Follow the naming convention =eprolog-usage-<feature>=
5. Place new tests in the appropriate logical section
